
#Область ОбработчикиСобытий

// Формирует приходные движения регистра накопления ОстаткиТоваров.
Процедура ОбработкаПроведения(Отказ, Режим)

	// Формируем приходные движения для строк документа.
	Движения.ОстаткиТоваров.Записывать = Истина;

	Для Каждого СтрокаТоваровДокумента Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = СтрокаТоваровДокумента.Товар;
		Движение.Количество = СтрокаТоваровДокумента.Количество;
		Движение.Сумма = СтрокаТоваровДокумента.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
